#### 📖 Terraform Plan ('src/common/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [20s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [20s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [10s elapsed]
data.azurerm_linux_function_app.com_citizen_func: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [10s elapsed]
module.apim_itn.data.azurerm_linux_web_app.cgn_pe_backend_app_01: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
        name                          = "io-p-itn-platform-api-gateway-apim-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.2.1"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

      ~ hostname_configuration {
          ~ proxy {
              ~ default_ssl_binding             = true -> false
                # (12 unchanged attributes hidden)
            }
        }

        # (8 unchanged blocks hidden)
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_monitor_autoscale_setting.this[0] will be created
  + resource "azurerm_monitor_autoscale_setting" "this" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-platform-sbns-as-01"
      + resource_group_name = "io-p-itn-common-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + target_resource_id  = (known after apply)

      + profile {
          + name = "Default"

          + capacity {
              + default = 1
              + maximum = 2
              + minimum = 1
            }

          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "NamespaceCpuUsage"
                  + metric_namespace         = "microsoft.servicebus/namespaces"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "GreaterThanOrEqual"
                  + statistic                = "Average"
                  + threshold                = 70
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ServiceAllowedNextValue"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "NamespaceCpuUsage"
                  + metric_namespace         = "microsoft.servicebus/namespaces"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "LessThanOrEqual"
                  + statistic                = "Average"
                  + threshold                = 20
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT10M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ServiceAllowedNextValue"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "NamespaceMemoryUsage"
                  + metric_namespace         = "microsoft.servicebus/namespaces"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "GreaterThanOrEqual"
                  + statistic                = "Average"
                  + threshold                = 60
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ServiceAllowedNextValue"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "NamespaceMemoryUsage"
                  + metric_namespace         = "microsoft.servicebus/namespaces"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "LessThanOrEqual"
                  + statistic                = "Average"
                  + threshold                = 20
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT10M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ServiceAllowedNextValue"
                  + value     = 1
                }
            }
        }
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_private_endpoint.service_bus_pep[0] will be created
  + resource "azurerm_private_endpoint" "service_bus_pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-platform-sbns-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-common-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_service_bus_namespace"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.0.2"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-platform-sbns-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "namespace",
            ]
        }
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_servicebus_namespace.this will be created
  + resource "azurerm_servicebus_namespace" "this" {
      + capacity                            = 1
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + local_auth_enabled                  = false
      + location                            = "italynorth"
      + minimum_tls_version                 = "1.2"
      + name                                = "io-p-itn-platform-sbns-01"
      + premium_messaging_partitions        = 1
      + public_network_access_enabled       = true
      + resource_group_name                 = "io-p-itn-common-rg-01"
      + sku                                 = "Premium"
      + tags                                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_service_bus_namespace"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.0.2"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }

      + network_rule_set {
          + default_action                = "Allow"
          + public_network_access_enabled = false
          + trusted_services_allowed      = true
        }
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.apim_itn.module.apim.azurerm_api_management.this,
  on .terraform/modules/apim_itn.apim/main.tf line 18, in resource "azurerm_api_management" "this":
  18: resource "azurerm_api_management" "this" {

`key_vault_id` has been deprecated in favour of `key_vault_certificate_id`
and will be removed in v5.0 of the AzureRM provider

(and 20 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
